CATEGORY_CONDITIONAL_PARAMS = {
    "люстры": [
        "размер",
        "внешний вид",
        "цоколь",
    ],
    "нестенные свтельники": [
        "размер",
        "цоколь",
    ],
    "трековые светильники": [
        "размер",
        "цоколь",
    ],
    "шинопроводы": [
        "размер",
    ],
    "точечные светильники": [
        "размер",
        "цоколь",
    ],
    "настольные лампы": [
        "размер",
        "цоколь",
    ],
    "торшеры": [
        "размер",
    ],
    "детские светильники": [
        "размер",
        "цоколь",
    ],
    "светильники в ванную комнату": [
        "размер"
    ],
    "уличные светильники": [
        "размер",
        "цоколь",
    ],
    "светодиодная лента": [
        "размер",
        "цоколь",
    ],
    "профили для светодиодной ленты": [
        "размер",
    ],
    "блоки питания для светодиодных лент": [
        "размер",
    ],
}
