from models.TestCondition.TestCondition import SizeStrategy, BaseCondition

# CATEGORY_CONDITIONAL_PARAMS = {
#     "люстры": [
#         "размер",
#         "форма",
#         "цоколь",
#     ],
#     "подвесные светильники": [
#         "размер",
#         "форма",
#         "цоколь",
#     ],
#     "потолочные светильники": [
#         "размер",
#         "форма",
#         "цоколь",
#     ],
#     "настенные свтельники": [
#         "размер",
#         "форма",
#         "цоколь",
#     ],
#     "трековые светильники": [
#         "размер",
#         "цоколь",
#     ],
#     "шинопроводы": [
#         "размер",
#     ],
#     "точечные светильники": [
#         "размер",
#         "цоколь",
#     ],
#     "настольные лампы": [
#         "размер",
#         "форма",
#         "цоколь",
#     ],
#     "торшеры": [
#         "размер",
#     ],
#     "детские светильники": [
#         "размер",
#         "форма",
#         "цоколь",
#     ],
#     "светильники в ванную комнату": [
#         "размер"
#         "цоколь",
#     ],
#     "уличные светильники": [
#         "размер",
#         "цоколь",
#     ],
#     "светодиодная лента": [
#         "размер",
#         "цоколь",
#     ],
#     "профили для светодиодной ленты": [
#         "размер",
#     ],
#     "блоки питания для светодиодных лент": [
#         "размер",
#     ],
# }


CATEGORY_CONDITIONAL_PARAMS = {
    "люстры": [
        SizeStrategy(),
        BaseCondition()
    ],
    "точечные светильники": [
        SizeStrategy(),
        BaseCondition(),
    ]
}